Revit 2025 API
ValidationStatus Enumeration
 Lists the validation type of the fabrication part.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ValidationStatus
Public Enumeration ValidationStatus
public enum class ValidationStatus
type ValidationStatus
Members
Member name | Value | Description
Valid | 0 |  The part is valid to fabrication.
InvalidDimensions | 1 |  The part has invalid dimensions.
NoMaterial | 2 |  The part has no material being specified.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace